Revit 2024 API
ContinuousRail.HostRailingId Property
 The id of the host Railing that contains this rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId HostRailingId { get; }
Visual Basic
Public ReadOnly Property HostRailingId As ElementId
	Get
Visual C++
public:
property ElementId^ HostRailingId {
	ElementId^ get ();
}
See Also
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace